Repository: mlverse/minhub
Catalog: po/R-*.po
Languages: fr

source: {.arg config$model_type} must be {.val gpt2}, got {.val {config$model_type}}
fr: La valeur de {.arg config$model_type} doit être {.val gpt2}, or elle est à {.val {config$model_type}}

source: {.arg config$layer_norm_eps} must be {.val 1e-5}.
fr: {.arg config$layer_norm_eps} doit être à {.val 1e-5}.

source: {.arg {names(pdrop)}} must be all equal, but got {pdrop}
fr: Les {.arg {names(pdrop)}} doivent être égaux, or ils sont à {pdrop}

source: {.arg initializer_range} must be {.val 0.02}, got {config$initializer_range}
fr: La valeur de {.arg initializer_range} doit être à {.val 0.02}, or elle est à {config$initializer_range}

source: {.arg config$model_type} must be {.val gpt_bigcode}.
fr: {.arg config$model_type} doit être {.val gpt_bigcode}.

source: Got {.val {config$model_type}}
fr: Or elle est à {.val {config$model_type}}

source: Must use {.arg config$multi_query} but got {.val FALSE}
fr: Il faut utiliser {.arg config$multi_query}, or c'est actuellement {.val FALSE}

source: All dropout must be equal.
fr: Tous les {.val dropout} doivent être égaux.

source: Got {.val {names(dropouts)}} respectively {.val {dropouts}}
fr: Or {.val {names(dropouts)}} sont respectivement à {.val {dropouts}}

source: {.arg config$layer_norm_eps} must be 1e-5, got {.val {config$layer_norm_eps}}
fr: La valeur de {.arg config$layer_norm_eps} doit être {.val 1e-5}, or elle est à {.val {config$layer_norm_eps}}

source: {.arg config$model_type} must be {.val gpt_neox}, got {.val {config$model_type}}
fr: {.arg config$model_type} doit être {.val gpt_neox}, or elle est à {.val {config$model_type}}

source: Non parallel residual is not supported.
fr: Les résidus non-parallèles ne sont pas pris en compte.

source: {.arg config$use_parallel_residual} is {.val FALSE}
fr: {.arg config$use_parallel_residual} est {.val FALSE}

source: Unsupported {.arg config$hidden_act}: {.val {config$hidden_act}}
fr: {.arg config$hidden_act} ne peut pas être {.val {config$hidden_act}}

source: Currently only {.val gelu} is supported.
fr: Actuellement seul {.val gelu} est pris en compte.

source: {.arg config$intermediate_size} must be 4*{.arg config$hidden_size}
fr: {.arg config$intermediate_size} doit être de 4*{.arg config$hidden_size}

source: Got {.val {config$intermediate_size}} and {.val {config$hidden_size}}
fr: Or nous avons respectivement {.val {config$intermediate_size}} et {.val {config$hidden_size}}

source: {.arg config$model_type} must be {.val llama}, got {.val {config$model_type}}
fr: {.arg config$model_type} doit être {.val llama}, or nous avons {.val {config$model_type}}

source: Currently only {.val silu} is supported.
fr: Actuellement seul {.val silu} est pris en compte.

source: Error downloading weights from {.val {c(WEIGHTS_NAME(), WEIGHTS_INDEX_NAME())}}
fr: Problème de téléchargement des points depuis {.val {c(WEIGHTS_NAME(), WEIGHTS_INDEX_NAME())}}

source: Traceback below shows the error when trying to download {.val {WEIGHTS_NAME()}}
fr: Le log suivant détaille l'erreur lors de la tentative de téléchargement de {.val {WEIGHTS_NAME()}}

source: No safetensors files found.
fr: Aucun fichier safetensors trouvé.
